{
  "title": "About Us - Federal Working Group",
  "description": "Learn about Federal Working Group, a diverse team of inventive thinkers and courageous doers committed to serving our customers since 2004.",
  "blocks": [
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h1",
            "children": [
              {
                "type": "text",
                "text": "ABOUT US"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "We are Federal Working Group, a diverse team of inventive thinkers and courageous doers, united by an unwavering commitment to serve our customers. Our culture thrives on curiosity, creativity, and collaboration – allowing us to develop cutting-edge solutions to achieve mission success for our clients. We value an entrepreneurial spirit and recognize that our employees are key to driving innovation that allows us to achieve our objectives. Join us and discover the incredible possibilities that come with being a part of a dynamic team of creative players."
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "Federal Working Group was established in 2004 as a competitive and high-performing company. The organization over the years has successfully grown from 4 employees to over 100. In addition to being recognized as an outstanding solutions provider, Federal Working Group also has a proven track record of exceeding customers' expectations."
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "THE FEDERAL WORKING GROUP DIFFERENCE"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "Federal Working Group is committed to providing our customers with best-in-class services, leading to innovative solutions and high satisfaction levels for our customers. Since our inception, we have achieved success based upon four key cornerstones."
              }
            ]
          }
        ]
      }
    }
  ]
}
