{
  "title": "Services - Federal Working Group",
  "description": "Comprehensive IT services and solutions for federal agencies, delivered by highly skilled professionals with proven expertise.",
  "blocks": [
    {
      "_template": "hero",
      "title": "Services and Solutions",
      "subtitle": "Comprehensive IT solutions for federal agencies",
      "backgroundImage": "https://i.imgur.com/85EwS5X.png"
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "The Federal Working Group (FWG) offers services and solutions, highlighting their difference as a small business. They emphasize effective support that builds customer trust and loyalty, evidenced by contract renewals and an Open Ratings score of 96 out of 100. FWG focuses on attracting and retaining highly skilled professionals within a lean corporate structure to deliver top talent at competitive rates, resulting in a low voluntary turnover rate among professional staff."
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "They possess corporate experience and capacity to manage large and complex contracts as a prime contractor, applying structured management frameworks from ITIL®, the Project Management Institute, the Software Engineering Institute, and other IT project management best practices. FWG utilizes flexible, adaptive project management approaches and tools tailored to individual customer requirements and their unique organizational and technical environments. They also identify, engage, and hire \"best of breed\" staff, specialized consultants, or subcontractors through various means. The company fosters a highly collaborative and collegial work environment based on fairness and transparent business understandings."
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "services",
      "heading": "Our Services",
      "services": [
        {
          "title": "Program and Project Management Services",
          "description": "Comprehensive project management utilizing ITIL®, PMI, and SEI best practices with flexible, adaptive approaches tailored to your organizational needs.",
          "icon": "/assets/service-bpm.jpg"
        },
        {
          "title": "IT Infrastructure, Technologies and Solutions",
          "description": "Cloud computing, data center management, network architecture, and IT modernization services to transform your technology landscape.",
          "icon": "/assets/service-cloud.png"
        },
        {
          "title": "Enterprise Architecture",
          "description": "Strategic enterprise architecture planning, design, and implementation aligned with your business goals and technical environment.",
          "icon": "/assets/service-enterprise.jpg"
        },
        {
          "title": "IT Security, Strategy and Operations",
          "description": "Cybersecurity, IT governance, risk management, and operational excellence frameworks to protect and optimize your systems.",
          "icon": "/assets/service-security.jpg"
        }
      ]
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "Contract Vehicles"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "We operate under CIOSP3 and other contract vehicles to provide streamlined procurement options."
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "Download our current IT Services Price List and Cloud Services Commercial Price List for detailed pricing information."
              }
            ]
          }
        ]
      }
    }
  ]
}
