{
  "title": "Success Stories - Federal Working Group",
  "description": "Explore Federal Working Group's success stories with Census Bureau, OCC, IRS, and USDA.",
  "blocks": [
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h1",
            "children": [
              {
                "type": "text",
                "text": "Success Stories"
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "Census Bureau"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "FWG played key roles in the planning and execution of the 2010 Decennial Census, providing technical expertise in field operations, space and logistics management, help desk operations, and system design and development support."
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "Office of the Comptroller of the Currency (OCC)"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "FWG supported OCC during the financial crisis in implementing Base II standards, providing system support, resource allocation, enterprise-level activities, and developing information clearinghouses and data collection methods."
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "Internal Revenue Service (IRS)"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "FWG provided strategic planning, communications, and management support for the IRS to fulfill its obligations under the Patient Protection and Affordable Care Act, including formulating strategies, developing a concept of operations, and providing tactical support for the ACA PMO."
              }
            ]
          }
        ]
      }
    },
    {
      "_template": "content",
      "body": {
        "type": "root",
        "children": [
          {
            "type": "h2",
            "children": [
              {
                "type": "text",
                "text": "USDA"
              }
            ]
          },
          {
            "type": "p",
            "children": [
              {
                "type": "text",
                "text": "FWG played a critical role in the development and launch of the USDA Public Health Information Systems (PHIS) training, which included developing documentation for computer-based training, delivering classroom-based training, and creating an innovative courseware platform."
              }
            ]
          }
        ]
      }
    }
  ]
}
